
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7637581280)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository.artifact-repository
  * google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/artifactregistry.admin&#34;]
  * google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/editor&#34;]
  * google_project_iam_member.gitops-sa-cloudstorage[&#34;roles/secretmanager.admin&#34;]
  * google_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]
* Delete
  * google_project_iam_member.gitops-sa-cloudstorage


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be created
  + resource "google_artifact_registry_repository" "artifact-repository" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "gig-japan-398904"
      + repository_id    = "ikigai.app"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = true
        }
    }

  # google_project_iam_member.gitops-sa-cloudstorage will be destroyed
  # (because resource uses count or for_each)
  - resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      - etag    = "BwYO/L2WL+o=" -> null
      - id      = "gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com" -> null
      - project = "gig-japan-398904" -> null
      - role    = "roles/editor" -> null
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/artifactregistry.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/artifactregistry.admin"
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/editor"] will be created
  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/editor"
    }

  # google_project_iam_member.gitops-sa-cloudstorage["roles/secretmanager.admin"] will be created
  + resource "google_project_iam_member" "gitops-sa-cloudstorage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com"
      + project = "gig-japan-398904"
      + role    = "roles/secretmanager.admin"
    }

  # google_project_service.api-resources["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "api-resources" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "gig-japan-398904"
      + service            = "artifactregistry.googleapis.com"
    }

Plan: 5 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":11,"Program":"tfcmt","SHA1":"3d7269221478b2a266db1a9e22dcb27baa9ae15f","Vars":{},"WorkflowName":"iaac_plan"} -->